[
    {
        "title": "S.W.A.T.",
        "year": 2003,
        "cast": [
          "Samuel L. Jackson",
          "Colin Farrell",
          "Michelle Rodriguez",
          "LL Cool J"
        ],
        "genres": [
          "Action",
          "Crime",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/S.W.A.T.-%20Under%20Siege%20%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "S.W.A.T. is a 2003 American action crime thriller film directed by Clark Johnson and written by David Ayer and David McKenna, with the story credited to Ron Mita and Jim McClain. Produced by Neal H. Moritz, it is based on the 1975 television series of the same name and stars Samuel L. Jackson, Colin Farrell, Michelle Rodriguez, LL Cool J, Josh Charles, Jeremy Renner, Brian Van Holt and Olivier Martinez. The plot follows Hondo (Jackson) and his SWAT team as they are tasked to escort an imprisoned drug kingpin/international fugitive to prison after he offers a $100 million reward to anyone who can break him out of police custody.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9d/S_w_a_t_ver6.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 385
      },
      {
        "title": "Something's Gotta Give",
        "year": 2003,
        "cast": [
          "Jack Nicholson",
          "Diane Keaton",
          "Keanu Reeves",
          "Amanda Peet",
          "Frances McDormand",
          "Jon Favreau"
        ],
        "genres": [
          "Romance",
          "Comedy",
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Something%20Borrowed%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Something's Gotta Give is a 2003 American romantic comedy-drama film written, produced and directed by Nancy Meyers. It stars Jack Nicholson and Diane Keaton as a successful 60-something and 50-something, who find love for each other in later life, despite being complete opposites. Keanu Reeves and Amanda Peet co-star, with Frances McDormand, Paul Michael Glaser, Jon Favreau, and KaDee Strickland playing key supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7d/Somethings_gotta_give.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 329
      },
      {
        "title": "Stealing Christmas",
        "year": 2003,
        "cast": [
          "Tony Danza",
          "Lea Thompson",
          "Angela Goethals"
        ],
        "genres": [
          "Comedy",
          "Drama"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Stealing%20Raden%20Saleh%20by%20Vj%20Muba%20-%20Mobifliks.com.mp4",
        "extract": "Stealing Christmas is an American made for television comedy-drama film directed by Gregg Champion and starring Tony Danza, Lea Thompson and Angela Goethals. It premiered on USA Network in 2003. It was later broadcast in the 25 Days of Christmas programming block on ABC Family and in 2020 it was part of Freeform's Kickoff to Christmas."
      },
      {
        "title": "Terminator 3: Rise of the Machines",
        "year": 2003,
        "cast": [
          "Arnold Schwarzenegger",
          "Nick Stahl",
          "Claire Danes",
          "Kristanna Loken"
        ],
        "genres": [
          "Action",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Terminator%20-%20%20Sarah%20Connor%20Chronicles%20-%20VJ%20Junior.mp4",
        "extract": "Terminator 3: Rise of the Machines is a 2003 American science fiction action film directed by Jonathan Mostow. Starring Arnold Schwarzenegger, Nick Stahl, Claire Danes, and Kristanna Loken, it is the third installment in the Terminator franchise and a sequel to Terminator 2: Judgment Day (1991). In its plot, the malevolent artificial intelligence Skynet sends a T-X (Loken)—a highly advanced Terminator—back in time to ensure the rise of machines by killing top members of the future human resistance as John Connor's (Stahl) location is unknown. The resistance sends back a reprogrammed T-850 (Schwarzenegger) to protect John and his future wife, Kate (Danes).",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/39/Terminator_3_Rise_of_the_Machines_movie.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 369
      },
      {
        "title": "Underworld",
        "year": 2003,
        "cast": [
          "Kate Beckinsale",
          "Scott Speedman",
          "Michael Sheen",
          "Shane Broller",
          "Erwin Leder",
          "Bill Nighy"
        ],
        "genres": [
          "Horror",
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Underworld.part1.VJ%20Junior.mobifiliks.com.445mb.mp4",
        "extract": "Underworld is a 2003 action horror film directed by Len Wiseman and written by Danny McBride, based on a story by Kevin Grevioux, Wiseman and McBride. Kevin Grevioux wrote the original screenplay. The film centers on the secret history of vampires and lycans. It is the first installment in the Underworld franchise. The main plot revolves around Selene, a vampire Death Dealer hunting Lycans. She finds herself attracted to a human, Michael Corvin, who is being targeted by the Lycans. After Michael is bitten by a Lycan, Selene must decide whether to do her duty and kill him or go against her clan and save him. Alongside Beckinsale and Speedman, the film stars Michael Sheen, Shane Brolly, and Bill Nighy.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cc/Underworld_%282003_film%29_poster.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 371
      },
      {
        "title": "44 Minutes: The North Hollywood Shoot-Out",
        "year": 2003,
        "cast": [
          "Michael Madsen",
          "Ron Livingston"
        ],
        "genres": [
          "Action",
          "Crime"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/44%20Minutes%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "44 Minutes: The North Hollywood Shoot-Out is a 2003 American crime action television film directed by Yves Simoneau and written by Tim Metcalfe. The film stars Michael Madsen, Ron Livingston, and Mario Van Peebles, and is based on the 1997 North Hollywood shootout. It premiered on the FX Network on June 5, 2003.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/70/44Minutes2003Poster.jpg",
        "thumbnail_width": 257,
        "thumbnail_height": 386
      },
      {
        "title": "Bulletproof Monk",
        "year": 2003,
        "cast": [
          "Chow Yun-fat",
          "Seann William Scott",
          "Jaime King"
        ],
        "genres": [
          "Action",
          "Comedy",
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Bulletproof%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Bulletproof Monk is a 2003 American superhero comedy film directed by Paul Hunter in his feature film directorial debut, and starring Chow Yun-fat, Seann William Scott, and Jaime King. The film is loosely based on the comic book written by Brett Lewis with art by Michael Avon Oeming. The film was shot in Toronto and Hamilton, Canada, and other locations that resemble New York City.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/c5/BulletproofMonk.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 371
      },
      {
        "title": "The Company",
        "year": 2003,
        "cast": [
          "Neve Campbell",
          "Malcolm McDowell",
          "James Franco"
        ],
        "genres": [
          "Drama",
          "Musical"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20company%20you%20keep%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Company is a 2003 American drama film directed by Robert Altman with a screenplay by Barbara Turner from a story by Turner and star and co-producer Neve Campbell. The film also stars Malcolm McDowell and James Franco, and is set in the company of the Joffrey Ballet.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/ef/Companymovieposter.jpg",
        "thumbnail_width": 262,
        "thumbnail_height": 379
      },
      {
        "title": "Darkness Falls",
        "year": 2003,
        "cast": [
          "Chaney Kley",
          "Emma Caulfield",
          "Lee Cormie"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Darkness%20Falls%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Darkness Falls is a 2003 supernatural horror film written by Joe Harris, James Vanderbilt and John Fasano, and directed by Jonathan Liebesman, in his feature directorial debut. The film stars Chaney Kley and Emma Caulfield, and follows Kyle Walsh (Kley), who witnesses his mother's murder at the hands of a vengeful spirit lynched by an angry mob more than 150 years ago. Twelve years later, Kyle returns to his childhood home because Michael Greene, the young brother of his romantic interest Caitlin (Caulfield), is being stalked by the same spirit. Kyle must protect them from this powerful enemy and put an end to its killing spree. Released on January 24, 2003, it was critically panned, but was considered a commercial success, grossing $47.5 million against a $11 million budget.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/0d/Darkness_Falls_movie.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Faster",
        "year": 2003,
        "cast": [
          "The",
          "motorcycle racing",
          "world championship",
          "MotoGP"
        ],
        "genres": [
          "Documentary"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Faster%20(2010)%20-%20VJ%20Junior%20-%20Mobifliks.mp4",
        "extract": "Faster is a 2003 documentary film about the motorcycle road racing world championship, MotoGP. Filmed between 2001 and 2002 by director Mark Neale, it features cinematography by music video director Grant Gee and is narrated by Ewan McGregor. It was succeeded by a 2-disc \"Ultimate Collector's Edition\" re-release in 2004 which included \"Faster '03-'04 The Sequel\". In 2006, The Doctor, The Tornado and The Kentucky Kid was released, followed by \"Fastest\" in 2011 and \"Hitting the Apex\" in 2015."
      },
      {
        "title": "The Italian Job",
        "year": 2003,
        "cast": [
          "Mark Wahlberg",
          "Charlize Theron",
          "Edward Norton",
          "Donald Sutherland",
          "Seth Green",
          "Jason Statham",
          "Mos Def",
          "Franky G"
        ],
        "genres": [
          "Action",
          "Crime"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Italian%20Job%20by%20Vj%20Tom%20-%20Mobifliks.com.mp4",
        "extract": "The Italian Job is a 2003 American heist action film directed by F. Gary Gray and starring an ensemble cast consisting of Mark Wahlberg, Charlize Theron, Edward Norton, Jason Statham, Seth Green, Mos Def, and Donald Sutherland. An American remake of the 1969 British film, but with an original story, the plot follows a motley crew of thieves who plan to steal gold from a former associate who double-crossed them. Despite the shared title, the plot and characters of this film differ from its source material; Gray described the film as \"an homage to the original.\"",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/db/Italianjob.jpg",
        "thumbnail_width": 258,
        "thumbnail_height": 387
      },
      {
        "title": "My Boss's Daughter",
        "year": 2003,
        "cast": [
          "Ashton Kutcher",
          "Tara Reid",
          "Terence Stamp"
        ],
        "genres": [
          "Romance",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/My%20Boss%20Daughter%20by%20Vj%20Emmy%20%20-%20Mobifliks.com.mp4",
        "extract": "My Boss's Daughter is a 2003 American comedy film directed by David Zucker. It stars Ashton Kutcher, Tara Reid and Terence Stamp. The film revolves around a man housesitting for his boss and getting into various hijinks with the people who come over to his place. My Boss's Daughter received negative reviews from critics and was a box office flop, grossing $18 million worldwide against a production budget of $14 million.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cd/My_bosss_daughter.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Mystic River",
        "year": 2003,
        "cast": [
          "Sean Penn",
          "Tim Robbins",
          "Kevin Bacon",
          "Laura Linney",
          "Laurence Fishburne",
          "Marcia Gay Harden"
        ],
        "genres": [
          "Crime",
          "Drama",
          "Noir"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Mystic%20River_VJ%20Mark%20-%20Mobifliks.com.mp4",
        "extract": "Mystic River is a 2003 American neo-noir crime drama film directed and co-produced by Clint Eastwood, and starring Sean Penn, Tim Robbins, Kevin Bacon, Laurence Fishburne, Marcia Gay Harden and Laura Linney. The screenplay, written by Brian Helgeland, was based on the 2001 novel of the same name by Dennis Lehane. It is the first film in which Eastwood was credited as composer of the score.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/93/Mystic_River_poster.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 373
      },
      {
        "title": "Peter Pan",
        "year": 2003,
        "cast": [
          "Jeremy Sumpter",
          "Rachel Hurd-Wood",
          "Jason Isaacs",
          "Ludivine Sagnier"
        ],
        "genres": [
          "Family",
          "Fantasy",
          "Adventure"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Peter%20Pan%20and%20Wendy%20by%20Vj%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Peter Pan is a 2003 fantasy adventure film directed by P. J. Hogan and written by Hogan and Michael Goldenberg. The screenplay is based on the 1904 play and 1911 novel Peter Pan, or The Boy Who Wouldn't Grow Up by J.M. Barrie and the Disney animated feature of the same name in 1953. Jason Isaacs plays the dual roles of Captain Hook and George Darling, Olivia Williams plays Mary Darling, while Jeremy Sumpter plays Peter Pan, Rachel Hurd-Wood plays Wendy Darling, and Ludivine Sagnier plays Tinker Bell. Lynn Redgrave plays a supporting role as Aunt Millicent, a new character created for the film.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/50/Peter_Pan_2003_film.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 386
      },
      {
        "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
        "year": 2003,
        "cast": [
          "Orlando Bloom",
          "Johnny Depp",
          "Keira Knightley",
          "Geoffrey Rush"
        ],
        "genres": [
          "Action",
          "Fantasy",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Pirates%20of%20the%20Caribbean%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Pirates of the Caribbean: The Curse of the Black Pearl is a 2003 American supernatural swashbuckler film directed by Gore Verbinski and the first film in the Pirates of the Caribbean film series. Produced by Walt Disney Pictures and Jerry Bruckheimer, the film is based on Walt Disney's Pirates of the Caribbean attraction at Disney theme parks. The story follows pirate Jack Sparrow and blacksmith Will Turner as they rescue the kidnapped Elizabeth Swann from the cursed crew of the Black Pearl, captained by Hector Barbossa, who become undead skeletons in moonlight.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/89/Pirates_of_the_Caribbean_-_The_Curse_of_the_Black_Pearl.png",
        "thumbnail_width": 259,
        "thumbnail_height": 386
      },
      {
        "title": "Quicksand",
        "year": 2003,
        "cast": [
          "Michael Keaton",
          "Michael Caine"
        ],
        "genres": [
          "Crime",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Quicksand%20by%20Vj%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "Quicksand is a 2003 direct-to-video British-French-German co-produced crime thriller film starring Michael Keaton and Michael Caine. The film was released in Germany, Finland, Sweden and Norway in 2003, in United States on 16 March 2004 and in the United Kingdom on 1 November 2004. Quicksand was filmed in South France between December 2000 and January 2001, originally set for a 2002 release.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/19/Quicksanddvd.jpg",
        "thumbnail_width": 262,
        "thumbnail_height": 379
      },
      {
        "title": "Radio",
        "year": 2003,
        "cast": [
          "Ed Harris",
          "Cuba Gooding, Jr.",
          "Debra Winger"
        ],
        "genres": [
          "Biography",
          "Drama",
          "Sports"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Radio%20Rebel%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Radio is a 2003 American semi-biographical sports drama film directed by Mike Tollin, and inspired by the 1996 Sports Illustrated article \"Someone to Lean On\" by Gary Smith. The article and the movie are based on the true story of T. L. Hanna High School football coach Harold Jones and a young man with an intellectual disability, James Robert \"Radio\" Kennedy. The film co-stars Debra Winger and Alfre Woodard. It was filmed primarily in Walterboro, South Carolina because its buildings and downtown core still fit the look of the era the film was trying to depict.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/4a/Radio-movie_Poster.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "The Room",
        "year": 2003,
        "cast": [
          "Tommy Wiseau",
          "Juliette Danielle"
        ],
        "genres": [
          "Drama",
          "Independent",
          "Romance"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Room_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Room is a 2003 American independent romantic drama film written, produced, executive produced and directed by Tommy Wiseau, who stars in the film alongside Juliette Danielle and Greg Sestero. Set in San Francisco, the film is centred around a melodramatic love triangle between amiable banker Johnny (Wiseau), his deceptive fiancée Lisa (Danielle) and his conflicted best friend Mark (Sestero). A significant portion of the film is dedicated to a series of unrelated subplots, most of which involve at least one supporting character and are left unresolved due to the film's inconsistent narrative structure. The work was reportedly intended to be semi-autobiographical in nature; according to Wiseau, the title alludes to the potential of a room to be the site of both good and bad events. The stage play from which the film is derived was so-called due to its events taking place entirely in a single room.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e1/TheRoomMovie.jpg",
        "thumbnail_width": 282,
        "thumbnail_height": 365
      }
]