[
    {
        "title": "Annabelle: Creation",
        "year": 2017,
        "cast": [
          "Stephanie Sigman",
          "Talitha Bateman",
          "Anthony LaPaglia",
          "Miranda Otto"
        ],
        "genres": [
          "Horror",
          "Supernatural"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Anabelle%20Creation%20-%20VJ%20Emmy_luganda_mobifliks.com.mp4",
        "extract": "Annabelle: Creation is a 2017 American supernatural horror film directed by David F. Sandberg, written by Gary Dauberman and produced by Peter Safran and James Wan. It is a prequel to 2014's Annabelle and the fourth installment in The Conjuring Universe franchise. The film stars Stephanie Sigman, Talitha Bateman, Anthony LaPaglia, and Miranda Otto, and depicts the possessed Annabelle doll's origin.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/08/Annabelle_Creation.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Dark Tower",
        "year": 2017,
        "cast": [
          "Idris Elba",
          "Matthew McConaughey",
          "Tom Taylor",
          "Fran Kranz",
          "Abbey Lee",
          "Katheryn Winnick",
          "Jackie Earle Haley",
          "Claudia Kim"
        ],
        "genres": [
          "Action",
          "Fantasy",
          "Western"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Dark%20Tower%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Dark Tower is a 2017 American science fantasy Western action film directed and co-written by Nikolaj Arcel. Based on Stephen King's novel series of the same name, the film stars Idris Elba as Roland Deschain, a gunslinger on a quest to protect the Dark Tower—a mythical structure which supports all realities—while Matthew McConaughey plays his nemesis, Walter Padick and Tom Taylor stars as Jake Chambers, a boy who becomes Roland's apprentice.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/49/The_Dark_Tower_teaser_poster.jpg",
        "thumbnail_width": 248,
        "thumbnail_height": 367
      },
      {
        "title": "Kidnap",
        "year": 2017,
        "cast": [
          "Halle Berry",
          "Sage Correa",
          "Lew Temple",
          "Chris McGinn"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Kidnap_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Kidnap is a 2017 American action-thriller film directed by Luis Prieto and written by Knate Lee. It stars Halle Berry, Sage Correa, Chris McGinn, and Lew Temple. The plot follows a working mother who pursues her young son's captors. The film was produced by di B Pictures, Lotus Entertainment, 606 Films, Gold Star Films, Ingenious Media, Well Go USA, and Rumble Entertainment on a budget of $21 million. It was announced in September 2014, and filmed in New Orleans and Slidell, Louisiana from October to December 2014.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1b/Kidnap_%282017_film%29_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      
      {
        "title": "Happy Death Day",
        "year": 2017,
        "cast": [
          "Jessica Rothe",
          "Israel Broussard",
          "Ruby Modine"
        ],
        "genres": [
          "Comedy",
          "Slasher"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Happy%20Death%20Day%202U%20-%20VJ%20Junior%20-%20Luganda.mp4",
        "extract": "Happy Death Day is a 2017 American black comedy slasher film directed by Christopher Landon, and written by Scott Lobdell. It stars Jessica Rothe and Israel Broussard. The film was produced by Jason Blum through his Blumhouse Productions banner, in association with Digital Riot Media and Vesuvius Productions. It follows a college student who is murdered on the night of her birthday and begins reliving the day repeatedly, at which point she sets out to find the killer and stop her death.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a7/Happy_Death_Day_poster.png",
        "thumbnail_width": 250,
        "thumbnail_height": 375
      },
      {
        "title": "First Kill",
        "year": 2017,
        "cast": [
          "Hayden Christensen",
          "Bruce Willis",
          "Gethin Anthony",
          "Megan Leonard",
          "Tyler Jon Olson",
          "Shea Buckner",
          "William DeMeo"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/First%20Kill%20-%20VJ%20Emmy%20-%20Mobifliks.com.mp4",
        "extract": "First Kill is a 2017 American action thriller film directed by Steven C. Miller and written by Nick Gordon. The film stars Hayden Christensen and Bruce Willis.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/88/First_Kill_%282017_film%29.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 383
      },
      {
        "title": "Atomic Blonde",
        "year": 2017,
        "cast": [
          "Charlize Theron",
          "James McAvoy",
          "John Goodman",
          "Til Schweiger",
          "Sofia Boutella",
          "Toby Jones",
          "Eddie Marsan",
          "Roland Møller"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Atomic%20Blonde%20by%20Vj%20Ice%20P%20-%20Mobifliks.com.mp4",
        "extract": "Atomic Blonde is a 2017 American action thriller film directed by David Leitch from a screenplay by Kurt Johnstad, based on the 2012 graphic novel The Coldest City by Antony Johnston and Sam Hart. The film stars Charlize Theron, James McAvoy, John Goodman, Til Schweiger, Eddie Marsan, Sofia Boutella, and Toby Jones. The story revolves around a spy who has to find a list of double agents that is being smuggled into the West on the eve of the collapse of the Berlin Wall in 1989.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b5/Atomic_Blonde_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 332
      },
      {
        "title": "Inconceivable",
        "year": 2017,
        "cast": [
          "Nicolas Cage",
          "Faye Dunaway",
          "Gina Gershon",
          "Nicky Whelan"
        ],
        "genres": [
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Inconceivable%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Inconceivable is a 2017 American thriller film directed by Jonathan Baker and written by Chloe King. It stars Gina Gershon, Faye Dunaway, Nicolas Cage, Nicky Whelan and Natalie Eva Marie. The film was released on June 30, 2017, by Lionsgate Premiere.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d0/Inconceivable_poster.png",
        "thumbnail_width": 254,
        "thumbnail_height": 392
      },
      {
        "title": "Baby Driver",
        "year": 2017,
        "cast": [
          "Ansel Elgort",
          "Lily James",
          "Jamie Foxx",
          "Jon Hamm",
          "Kevin Spacey",
          "Jon Bernthal",
          "Eiza González"
        ],
        "genres": [
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Baby%20Driver_VJ%20Junior_Luganda_mobifliks.com.mp4",
        "extract": "Baby Driver is a 2017 action film written and directed by Edgar Wright. It stars Ansel Elgort as a getaway driver seeking freedom from a life of crime with his girlfriend Debora. Kevin Spacey, Jon Hamm, Eiza González, Jamie Foxx, and Jon Bernthal appear in supporting roles. Eric Fellner and his Working Title Films partner Tim Bevan produced Baby Driver in association with Big Talk Productions' Nira Park. Sony and TriStar Pictures handled commercial distribution of the film. Baby Driver was financed through a co-production pact between TriStar and MRC and tax subsidies from the Georgia state government.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/8/8e/Baby_Driver_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Transformers: The Last Knight",
        "year": 2017,
        "cast": [
          "Mark Wahlberg",
          "Josh Duhamel",
          "Anthony Hopkins",
          "Laura Haddock",
          "Isabela Moner",
          "John Turturro",
          "Jerrod Carmichael",
          "Stanley Tucci",
          "Peter Cullen",
          "John Goodman",
          "John DiMaggio"
        ],
        "genres": [
          "Action",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Transformers%205-%20The%20Last%20Knight%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Transformers: The Last Knight is a 2017 American science fiction action film based on Hasbro's Transformers toy line. The film is the fifth installment in the Transformers film series and the sequel to Transformers: Age of Extinction (2014). The film is directed by Michael Bay from a screenplay by Art Marcum, Matt Holloway, and Ken Nolan. It stars Mark Wahlberg reprising his role from Age of Extinction, while Josh Duhamel, John Turturro, and Glenn Morshower reprise their roles from the first three films, as well as Laura Haddock, Isabela Moner, Jerrod Carmichael, Santiago Cabrera, and Anthony Hopkins all joining the cast.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/26/Transformers_The_Last_Knight_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "47 Meters Down",
        "year": 2017,
        "cast": [
          "Mandy Moore",
          "Claire Holt",
          "Matthew Modine",
          "Chris J. Johnson",
          "Yani Gellman",
          "Santiago Segura"
        ],
        "genres": [
          "Horror"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/47%20Meters%20Down%20Uncaged%20-%20VJ%20Emmy%20-%20Luganda.mp4",
        "extract": "47 Meters Down is a 2017 survival horror film directed by Johannes Roberts, written by Roberts and Ernest Riera, and starring Claire Holt and Mandy Moore. The plot follows two sisters who are invited to cage dive while on holiday in Mexico. When the winch system holding the cage breaks and the cage plummets to the ocean floor with the two girls trapped inside, they must find a way to escape, with their air supplies running low and great white sharks stalking nearby.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/e/e5/47_Meters_Down_%282017%29_Theatrical_Release_Poster.png",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "The Mummy",
        "year": 2017,
        "cast": [
          "Tom Cruise",
          "Russell Crowe",
          "Sofia Boutella",
          "Annabelle Wallis",
          "Jake Johnson",
          "Marwan Kenzari",
          "Courtney B. Vance"
        ],
        "genres": [
          "Action",
          "Adventure",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=The.Mummy.Resurrection.2023%20www.mobifliks.com%20305MB.mp4",
        "extract": "The Mummy is a 2017 American action-adventure fantasy film directed by Alex Kurtzman and written by David Koepp, Christopher McQuarrie, and Dylan Kussman, with a story by Kurtzman, Jon Spaihts, and Jenny Lumet. A reboot of The Mummy franchise as part of Universal's scrapped Dark Universe series, it stars Tom Cruise as U.S. Army Sergeant Nick Morton, a soldier of fortune who accidentally unearths the ancient tomb of entrapped Egyptian princess Ahmanet. Annabelle Wallis, Jake Johnson, Courtney B. Vance, and Russell Crowe also star.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a2/The_Mummy_%282017%29.jpg",
        "thumbnail_width": 259,
        "thumbnail_height": 384
      },
      {
        "title": "War Machine",
        "year": 2017,
        "cast": [
          "Michael Hastings",
          "(book)",
          "Brad Pitt",
          "Anthony Michael Hall",
          "Topher Grace",
          "Anthony Hayes",
          "Will Poulter",
          "Ben Kingsley",
          "Tilda Swinton"
        ],
        "genres": [
          "Comedy",
          "War"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/War%20Machine%20-%20VJ%20Mark%20-%20Mobifliks.com.mp4",
        "extract": "War Machine is a 2017 American satirical war comedy film directed and written by David Michôd and starring Brad Pitt, Anthony Michael Hall, Anthony Hayes, Topher Grace, Will Poulter, Tilda Swinton, and Ben Kingsley. Based on the nonfiction book The Operators: The Wild and Terrifying Inside Story of America's War in Afghanistan by Michael Hastings, it is a fictionalized version of the events in the book based on United States Army General Stanley McChrystal.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1a/War_Machine_%28film%29.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Wonder Woman",
        "year": 2017,
        "cast": [
          "Gal Gadot",
          "Chris Pine",
          "Connie Nielsen",
          "Robin Wright",
          "Danny Huston",
          "David Thewlis",
          "Elena Anaya"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Wonder%20Woman_Luganda_264_www.mobifliks.com.mp4",
        "extract": "Wonder Woman is a 2017 superhero film based on the DC Comics character of the same name. Produced by Warner Bros. Pictures, DC Films, Atlas Entertainment and Cruel and Unusual Films, and distributed by Warner Bros. Pictures, it is the fourth installment of the DC Extended Universe (DCEU), and a prequel/spin-off to Batman v Superman: Dawn of Justice (2016). Directed by Patty Jenkins and written by Allan Heinberg from a story by Heinberg, Zack Snyder and Jason Fuchs, Wonder Woman stars Gal Gadot in the title role, alongside Chris Pine, Robin Wright, Danny Huston, David Thewlis, Connie Nielsen and Elena Anaya. It is the second live action theatrical film featuring Wonder Woman following her debut in Batman v Superman: Dawn of Justice. In Wonder Woman, the Amazon princess Diana sets out to stop World War I, believing the conflict was started by the longtime enemy of the Amazons, Ares, after American pilot and spy Steve Trevor crash-lands on their island Themyscira and informs her about it.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b0/Wonder_Woman_%282017_film%29_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Alien: Covenant",
        "year": 2017,
        "cast": [
          "Michael Fassbender",
          "Katherine Waterston",
          "Demián Bichir",
          "Billy Crudup",
          "Danny McBride"
        ],
        "genres": [
          "Action",
          "Horror",
          "Science Fiction"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Alien%20Covenant_VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Alien: Covenant is a 2017 science fiction action horror film directed and produced by Ridley Scott and written by John Logan and Dante Harper, from a story by Michael Green and Jack Paglen. A joint American and British production, it is a sequel to Prometheus (2012), the second entry in the Alien prequel series, and the sixth installment in the Alien franchise, three of which have been directed by Scott. It features returning star Michael Fassbender, with Katherine Waterston, Billy Crudup, Danny McBride and Demián Bichir in supporting roles. It follows the crew of a colony ship that lands on an uncharted planet and makes a terrifying discovery.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/33/Alien_Covenant_Teaser_Poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "King Arthur: Legend of the Sword",
        "year": 2017,
        "cast": [
          "Charlie Hunnam",
          "Jude Law",
          "Àstrid Bergès-Frisbey",
          "Djimon Hounsou",
          "Aidan Gillen",
          "Eric Bana"
        ],
        "genres": [
          "Action",
          "Adventure",
          "Fantasy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/King%20Arthur%20-%20Legend%20Of%20The%20Sword%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "King Arthur: Legend of the Sword is a 2017 epic fantasy action-adventure film directed by Guy Ritchie who co-wrote the film with Joby Harold and Lionel Wigram from a story by Harold and David Dobkin, inspired by Arthurian legends. The film stars Charlie Hunnam as the title character and Jude Law as the tyrannical king Vortigern who is attempting to kill him, with Àstrid Bergès-Frisbey, Djimon Hounsou, Aidan Gillen, and Eric Bana in supporting roles.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/King_Arthur_LotS_poster.jpg/320px-King_Arthur_LotS_poster.jpg",
        "thumbnail_width": 320,
        "thumbnail_height": 239
      },
      
      {
        "title": "Aftermath",
        "year": 2017,
        "cast": [
          "Arnold Schwarzenegger",
          "Scoot McNairy",
          "Maggie Grace",
          "Martin Donovan"
        ],
        "genres": [
          "Drama",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Aftermath_VJ%20Junior%20-%20Mobilfiks.com.mp4",
        "extract": "Aftermath is a 2017 American drama thriller film directed by Elliott Lester and written by Javier Gullón. The film, starring Arnold Schwarzenegger, Scoot McNairy, Maggie Grace, and Martin Donovan, was released on April 7, 2017, by Lionsgate Premiere. It is based on events and people surrounding the 2002 Überlingen mid-air collision of a passenger airliner with a cargo jet, although the names, places, nationalities, and incidents were changed. It was released on video on demand.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9b/Aftermath_film_poster.png",
        "thumbnail_width": 254,
        "thumbnail_height": 392
      },
      {
        "title": "The Fate of the Furious by Vj Junior",
        "year": 2017,
        "cast": [
          "Vin Diesel",
          "Dwayne Johnson",
          "Michelle Rodriguez",
          "Kurt Russell",
          "Charlize Theron",
          "Jason Statham",
          "Helen Mirren",
          "Tyrese Gibson",
          "Chris Bridges",
          "Elsa Pataky",
          "Nathalie Emmanuel",
          "Scott Eastwood"
        ],
        "genres": [
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Fate%20of%20The%20Furious%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "The Fate of the Furious is a 2017 American action film directed by F. Gary Gray and written by Chris Morgan. It is the sequel to Furious 7 (2015) and the eighth installment in the Fast & Furious franchise. The film stars Vin Diesel as Dominic Toretto, alongside Dwayne Johnson, Jason Statham, Michelle Rodriguez, Tyrese Gibson, Chris \"Ludacris\" Bridges, Scott Eastwood, Nathalie Emmanuel, Elsa Pataky, Kurt Russell, Charlize Theron and Kristofer Hivju. In the film, Dom has settled down with his wife Letty Ortiz, until cyberterrorist Cipher (Theron) coerces him into working for her and turns him against his team, forcing them to find Dom and take down Cipher.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2d/The_Fate_of_The_Furious_Theatrical_Poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 348
      },
      {
        "title": "The Fate of the Furious by Vj Mark",
        "year": 2017,
        "cast": [
          "Vin Diesel",
          "Dwayne Johnson",
          "Michelle Rodriguez",
          "Kurt Russell",
          "Charlize Theron",
          "Jason Statham",
          "Helen Mirren",
          "Tyrese Gibson",
          "Chris Bridges",
          "Elsa Pataky",
          "Nathalie Emmanuel",
          "Scott Eastwood"
        ],
        "genres": [
          "Action"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Fate%20of%20the%20Furious%208%20-%20VJ%20Mark%20-%20Luganda.mp4",
        "extract": "The Fate of the Furious is a 2017 American action film directed by F. Gary Gray and written by Chris Morgan. It is the sequel to Furious 7 (2015) and the eighth installment in the Fast & Furious franchise. The film stars Vin Diesel as Dominic Toretto, alongside Dwayne Johnson, Jason Statham, Michelle Rodriguez, Tyrese Gibson, Chris \"Ludacris\" Bridges, Scott Eastwood, Nathalie Emmanuel, Elsa Pataky, Kurt Russell, Charlize Theron and Kristofer Hivju. In the film, Dom has settled down with his wife Letty Ortiz, until cyberterrorist Cipher (Theron) coerces him into working for her and turns him against his team, forcing them to find Dom and take down Cipher.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/2/2d/The_Fate_of_The_Furious_Theatrical_Poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 348
      },
      {
        "title": "The Boss Baby: Christmas Business",
        "year": 2017,
        "cast": [
          "Alec Baldwin",
          "Steve Buscemi",
          "Jimmy Kimmel",
          "Lisa Kudrow",
          "Tobey Maguire",
          "Miles Bakshi"
        ],
        "genres": [
          "Animated",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Boss%20Baby-%20Christmas%20Bonus%20by%20Vj%20Kevo%20-%20Mobifliks.com.mov",
        "extract": "Christmas Eve takes a twisty turn when the Boss Baby accidentally swaps places with one of Santas elves and gets stranded at the North Pole.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/The%20Boss%20Baby%20Christmas%20Bonus%20(2022).jpg&h=220&w=140&a=t&zc=1",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Logan",
        "year": 2017,
        "cast": [
          "Hugh Jackman",
          "Patrick Stewart",
          "Boyd Holbrook",
          "Stephen Merchant",
          "Richard E. Grant",
          "Eriq La Salle",
          "Elise Neal",
          "Elizabeth Rodriguez",
          "Dafne Keen"
        ],
        "genres": [
          "Superhero"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Logan_Luganda_264_www.mobifliks.com.mp4",
        "extract": "Logan is a 2017 American superhero film starring Hugh Jackman as the titular character. It is the tenth film in the X-Men film series and the third and final installment in the Wolverine trilogy following X-Men Origins: Wolverine (2009) and The Wolverine (2013). The film, which takes inspiration from the \"Old Man Logan\" comics storyline by Mark Millar and Steve McNiven, follows an aged Wolverine and an extremely ill Charles Xavier who defends a young mutant named Laura from the villainous Reavers led by Donald Pierce and Zander Rice. The film is produced by 20th Century Fox, Marvel Entertainment, TSG Entertainment and The Donners' Company, and distributed by 20th Century Fox. It is directed by James Mangold, who co-wrote the screenplay with Michael Green and Scott Frank, from a story by Mangold. In addition to Jackman, the film also stars Patrick Stewart, Richard E. Grant, Boyd Holbrook, Stephen Merchant, and introducing Dafne Keen in her film debut as Laura.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/37/Logan_2017_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Rock Dog 3: Battle the Beat",
        "year": 2017,
        "cast": [
          "Luke Wilson",
          "Eddie Izzard",
          "J. K. Simmons",
          "Lewis Black",
          "Kenan Thompson",
          "Mae Whitman",
          "Jorge Garcia",
          "Matt Dillon",
          "Sam Elliott"
        ],
        "genres": [
          "Animated",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Rock%20Dog%203-%20Battle%20the%20Beat%20by%20Vj%20Kevo%20-%20Mobifliks.com.mp4",
        "extract": "When the young performers on a music contest show admit they have never heard of Angus Scattergood, Bodi is compelled to join the show to restore the Rock Legends good name.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a1/Rock_Dog_2016_Teaser_Poster.jpg",
        "thumbnail_width": 250,
        "thumbnail_height": 386
      },
      {
        "title": "Rock Dog",
        "year": 2017,
        "cast": [
          "Luke Wilson",
          "Eddie Izzard",
          "J. K. Simmons",
          "Lewis Black",
          "Kenan Thompson",
          "Mae Whitman",
          "Jorge Garcia",
          "Matt Dillon",
          "Sam Elliott"
        ],
        "genres": [
          "Animated",
          "Comedy"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Rock%20Dog%20by%20Vj%20Kevo%20-%20Mobifliks.com.mp4",
        "extract": "When a radio falls from the sky into the hands of a wide-eyed Tibetan Mastiff, he leaves home to fulfill his dream of becoming a musician, setting into motion a series of completely unexpected events.",
        "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=/admin/thumbs/Rock%20Dog%20(2016.jpg&h=380&w=250&a=t&zc=1",
        "thumbnail_width": 250,
        "thumbnail_height": 386
      },
      {
        "title": "Collide",
        "year": 2017,
        "cast": [
          "Nicholas Hoult",
          "Felicity Jones",
          "Marwan Kenzari",
          "Anthony Hopkins",
          "Ben Kingsley"
        ],
        "genres": [
          "Action",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Collide%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Collide is a 2016 action thriller film directed by Eran Creevy, who also co-wrote it with F. Scott Frazier. The film stars Nicholas Hoult, Felicity Jones, Marwan Kenzari, Ben Kingsley, and Anthony Hopkins. The plot follows two young Americans living in Germany who must complete a drug theft from a crime boss in order to pay for a medical operation.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f3/Collide_film_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
      {
        "title": "Unforgettable",
        "year": 2017,
        "cast": [
          "Katherine Heigl",
          "Rosario Dawson",
          "Geoff Stults"
        ],
        "genres": [
          "Drama",
          "Thriller"
        ],
        "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Unforgettable%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
        "extract": "Unforgettable is a 2017 American drama thriller film directed by Denise Di Novi and written by Christina Hodson. The film stars Rosario Dawson, Katherine Heigl, Geoff Stults, Isabella Rice, and Cheryl Ladd, and follows a divorcée who begins to torment her ex-husband's new fiancée.",
        "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/66/Unforgettable_2017_poster.jpg",
        "thumbnail_width": 220,
        "thumbnail_height": 326
      },
        {
          "title": "Jumanji: Welcome to the Jungle",
          "year": 2017,
          "cast": [
            "Dwayne Johnson",
            "Kevin Hart",
            "Jack Black",
            "Karen Gillan",
            "Nick Jonas",
            "Bobby Cannavale"
          ],
          "genres": [
            "Adventure",
            "Comedy",
            "Fantasy"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Jumanji%20Welcome%20To%20The%20Jungle_Luganda_264_www.mobifliks.com.mp4",
          "extract": "Jumanji: Welcome to the Jungle is a 2017 American fantasy adventure comedy film directed by Jake Kasdan from a screenplay by Chris McKenna, Erik Sommers, Scott Rosenberg, and Jeff Pinkner. The film is the third installment in the Jumanji film series and a standalone sequel to Jumanji (1995). It stars Dwayne Johnson, Jack Black, Kevin Hart, Karen Gillan, Nick Jonas, and Bobby Cannavale. The story focuses on a group of teenagers who come across Jumanji, now transformed into a video game twenty-two years after the events of the 1995 film. They find themselves trapped in the game as a set of adult avatars, seeking to complete a quest alongside another player who has been trapped since 1996.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/dc/Jumanji_Welcome_to_the_Jungle.png",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Mayhem",
          "year": 2017,
          "cast": [
            "Steven Yeun",
            "Samara Weaving",
            "Steven Brand",
            "Caroline Chikezie",
            "Kerry Fox",
            "Dallas Roberts"
          ],
          "genres": [
            "Action",
            "Comedy"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Mayhem_VJ%20ICE%20P%20-%20Mobifliks.com.mp4",
          "extract": "Mayhem is a 2017 American action comedy film directed by Joe Lynch and written by Matias Caruso. The film was released at the South by Southwest Film Festival in March 2017, and The Sales art and poster was released at the Cannes Film Festival in May 2017. It was released in US cinemas and on VOD and digital HD on November 10, 2017, through RLJE Films.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1e/Mayhem2017.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 325
        },
        {
          "title": "Justice League",
          "year": 2017,
          "cast": [
            "Ben Affleck",
            "Henry Cavill",
            "Gal Gadot",
            "Jason Momoa",
            "Ezra Miller",
            "Ray Fisher",
            "Amy Adams",
            "Jeremy Irons",
            "Diane Lane",
            "J. K. Simmons",
            "Ciarán Hinds"
          ],
          "genres": [
            "Superhero"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Justice%20League%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
          "extract": "Justice League is a 2017 American superhero film based on the DC Comics superhero team of the same name. Produced by Warner Bros. Pictures, DC Films, RatPac-Dune Entertainment, Atlas Entertainment, and Cruel and Unusual Films and distributed by Warner Bros. Pictures, it is the fifth installment in the DC Extended Universe (DCEU). Directed by Zack Snyder and written by Chris Terrio and Joss Whedon, the film features an ensemble cast including Ben Affleck, Henry Cavill, Amy Adams, Gal Gadot, Ezra Miller, Jason Momoa, Ray Fisher, Jeremy Irons, Diane Lane, Connie Nielsen, and J. K. Simmons. In the film, following the events of Batman v Superman: Dawn of Justice (2016) Batman and Wonder Woman recruit The Flash, Aquaman, and Cyborg after the death of Superman to save the world from the catastrophic threat of Steppenwolf and his army of Parademons.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6b/Justice_League_%28film%29_poster.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Murder on the Orient Express",
          "year": 2017,
          "cast": [
            "Kenneth Branagh",
            "Penélope Cruz",
            "Willem Dafoe",
            "Judi Dench",
            "Johnny Depp",
            "Josh Gad",
            "Derek Jacobi",
            "Leslie Odom Jr.",
            "Michelle Pfeiffer",
            "Daisy Ridley",
            "Lucy Boynton",
            "Sergei Polunin"
          ],
          "genres": [
            "Mystery"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Murder%20on%20the%20Orient%20Express_VJ%20Emmy_Luganda_Mobifliks.com.mp4",
          "extract": "Murder on the Orient Express is a 2017 mystery film directed, co-produced by, and starring Kenneth Branagh as Hercule Poirot, written by Michael Green, and co-produced by Ridley Scott. Based on the 1934 novel of the same name by Agatha Christie, the film also stars an ensemble supporting cast consisting of Tom Bateman, Penélope Cruz, Willem Dafoe, Judi Dench, Johnny Depp, Josh Gad, Derek Jacobi, Leslie Odom Jr., Michelle Pfeiffer, and Daisy Ridley. The film is the fourth screen adaptation of Christie's novel, following the 1974 film, a 2001 TV film version, and a 2010 episode of the television series Agatha Christie's Poirot. The plot follows Poirot, a world-renowned detective, as he investigates a murder on the luxury Orient Express train service in the 1930s.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bd/Murder_on_the_Orient_Express_teaser_poster.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Daddy's Home 2",
          "year": 2017,
          "cast": [
            "Will Ferrell",
            "Mark Wahlberg",
            "Linda Cardellini",
            "John Cena",
            "Mel Gibson",
            "John Lithgow"
          ],
          "genres": [
            "Comedy"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Daddys%20Home%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
          "extract": "Daddy's Home 2 is a 2017 American Christmas buddy comedy film directed by Sean Anders and written by Anders and John Morris. A sequel to Daddy's Home (2015), it stars Will Ferrell, Mark Wahlberg, Linda Cardellini, John Cena, with John Lithgow and Mel Gibson. The plot follows now-reformed fathers Brad and Dusty, now co-parenting Dusty's kids, who have to deal with their own fathers visiting for the holidays.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/0/08/Daddy%27s_Home_2.png",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Jigsaw",
          "year": 2017,
          "cast": [
            "Tobin Bell",
            "Mandela Van Peebles",
            "Laura Vandervoort",
            "Brittany Allen",
            "Callum Keith Rennie",
            "Matt Passmore"
          ],
          "genres": [
            "Horror"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/JigSaw_VJ%20Junior%20-%20Luganda-www.mobiflks.com.mp4",
          "extract": "Jigsaw is a 2017 American horror film directed by the Spierig Brothers and written by Josh Stolberg and Peter Goldfinger. It is the eighth installment in the Saw film series and stars Matt Passmore, Callum Keith Rennie, Clé Bennett, and Hannah Emily Anderson. The plot follows a group of people who find themselves forced to participate in a series of deadly \"games\" inside a barn. Meanwhile, the police investigate a new series of murders that fit the modus operandi of the eponymous Jigsaw Killer, who has been dead for almost a decade.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/6/6e/Jigsaw_2017_poster.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 339
        },
        {
          "title": "Blade Runner 2049",
          "year": 2017,
          "cast": [
            "Harrison Ford",
            "Ryan Gosling",
            "Ana de Armas",
            "Mackenzie Davis",
            "Sylvia Hoeks",
            "Lennie James",
            "Carla Juri",
            "Robin Wright",
            "Dave Bautista",
            "Jared Leto"
          ],
          "genres": [
            "Noir",
            "Science Fiction"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Blade%20Runner-%20Black%20Lotus%203%20by%20Vj%20Kevo%20-%20Mobifliks.com.mp4",
          "extract": "Blade Runner 2049 is a 2017 American epic neo-noir science fiction film directed by Denis Villeneuve and written by Hampton Fancher and Michael Green. A sequel to the 1982 film Blade Runner, the film stars Ryan Gosling and Harrison Ford, with Ana de Armas, Sylvia Hoeks, Robin Wright, Mackenzie Davis, Dave Bautista, and Jared Leto in supporting roles. Ford and Edward James Olmos reprise their roles from the original film. Gosling plays K, a Nexus-9 replicant \"blade runner\" who uncovers a secret that threatens to destabilize society and the course of civilization.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9b/Blade_Runner_2049_poster.png",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Kingsman: The Golden Circle",
          "year": 2017,
          "cast": [
            "Colin Firth",
            "Julianne Moore",
            "Taron Egerton",
            "Mark Strong",
            "Halle Berry",
            "Elton John",
            "Channing Tatum",
            "Jeff Bridges"
          ],
          "genres": [
            "Action",
            "Comedy",
            "Spy"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/KingsMan%20The%20Golden%20circle_VJ%20Junior%20-%20Mobifliks.com.mp4",
          "extract": "Kingsman: The Golden Circle is a 2017 spy action comedy film directed by Matthew Vaughn and written by Jane Goldman and Vaughn. Based on the comic book series The Secret Service by Mark Millar and Dave Gibbons, the film serves as the second installment in the Kingsman film series and the sequel to Kingsman: The Secret Service (2014). The film features an ensemble cast consisting of Colin Firth, Taron Egerton, Mark Strong, Edward Holcroft, Hanna Alström, and Sophie Cookson, who reprise their roles from the first film, with Julianne Moore, Halle Berry, Pedro Pascal, Elton John, Channing Tatum, and Jeff Bridges joining the cast. The film follows members of Kingsman needing to team up with their American counterpart, Statesman, after their organization is crippled and the world is held hostage by Poppy Adams and her drug cartel, \"The Golden Circle\".",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fb/Kingsman_The_Golden_Circle.png",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
          "title": "Jeepers Creepers 3",
          "year": 2017,
          "cast": [
            "Jonathan Breck",
            "Meg Foster",
            "Brandon James",
            "Gabrielle Haugh",
            "Jordan Salloum",
            "Ryan Moore",
            "Brandon Smith",
            "Gina Philips",
            "Christine Ko",
            "Stan Shaw"
          ],
          "genres": [
            "Horror"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=Jeepers%20Creepers%20II%202003-luganda-www.mobifliks.com.mp4",
          "extract": "Jeepers Creepers 3 is a 2017 American horror film written and directed by Victor Salva and the third film in the Jeepers Creepers film series, taking place in between Jeepers Creepers and Jeepers Creepers 2. Jonathan Breck reprises his role as The Creeper. Gina Philips returns in a cameo as Trish Jenner, her first return to the series since the original film. The film was shown in theaters on September 26, 2017 in what was originally announced as a one-night-only showing and was then shown again on October 4.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/5/50/Jeepers_Creepers_3.jpg",
          "thumbnail_width": 258,
          "thumbnail_height": 387
        },
        {
          "title": "American Made",
          "year": 2017,
          "cast": [
            "Tom Cruise",
            "Domhnall Gleeson",
            "Sarah Wright",
            "Jayma Mays",
            "Jesse Plemons",
            "Alejandro Edda"
          ],
          "genres": [
            "Action",
            "Comedy"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/American%20Made%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
          "extract": "American Made is a 2017 American action comedy film directed by Doug Liman, written by Gary Spinelli, and starring Tom Cruise, Domhnall Gleeson, Sarah Wright, Alejandro Edda, Mauricio Mejía, Caleb Landry Jones, and Jesse Plemons. It is inspired by the life of Barry Seal, a former TWA pilot who flew missions for the CIA, and became a drug smuggler for the Medellín Cartel in the 1980s. In order to avoid jail time, Seal became an informant for the DEA.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/ca/American_Made_%28film%29.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 332
        },
        {
          "title": "Flatliners",
          "year": 2017,
          "cast": [
            "Elliot Page",
            "Diego Luna",
            "Nina Dobrev",
            "James Norton",
            "Kiersey Clemons",
            "Kiefer Sutherland"
          ],
          "genres": [
            "Drama",
            "Horror",
            "Science Fiction"
          ],
          "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Flat%20Liners%20-%20VJ%20Junior%20-%20Mobifliks.com.mp4",
          "extract": "Flatliners is a 2017 American science fiction psychological horror drama film directed by Niels Arden Oplev and written by Ben Ripley. A stand-alone sequel to and remake of the 1990 film of the same name, it stars Elliot Page, Diego Luna, Nina Dobrev, James Norton, and Kiersey Clemons. The story follows five medical students who attempt to conduct experiments that produce near-death experiences.",
          "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/35/Flatliners_%282017%29.jpg",
          "thumbnail_width": 220,
          "thumbnail_height": 326
        },
        {
            "title": "Arsenal",
            "year": 2017,
            "cast": [
              "Adrian Grenier",
              "Johnathon Schaech",
              "Nicolas Cage",
              "Lydia Hull",
              "Christopher Coppola",
              "Megan Leonard",
              "Christopher Rob Bowen",
              "Tyler Jon Olson",
              "Shea Buckner",
              "John Cusack"
            ],
            "genres": [
              "Action",
              "Thriller"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Arsenal_Luganda_www.mobifliks.com.mp4",
            "extract": "Arsenal is a 2017 American direct-to-video action thriller film directed by Steven C. Miller and written by Jason Mosberg. The film stars Adrian Grenier, John Cusack, Nicolas Cage and Johnathon Schaech. The film was released on January 6, 2017, by Lionsgate Premiere.",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/35/Arsenal_poster.jpg",
            "thumbnail_width": 220,
            "thumbnail_height": 326
          },
          {
            "title": "Monster Trucks",
            "year": 2017,
            "cast": [
              "Lucas Till",
              "Jane Levy",
              "Amy Ryan",
              "Holt McCallany",
              "Rob Lowe",
              "Danny Glover",
              "Barry Pepper"
            ],
            "genres": [
              "Comedy",
              "Animated"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Monster%20Trucks_VJ%20Junior_Luganda.mp4",
            "extract": "Monster Trucks is a 2017 American monster comedy film produced by Paramount Animation, Nickelodeon Movies and Disruption Entertainment for Paramount Pictures. It was directed by Chris Wedge, in both his live-action directorial debut and first directorial effort outside of Blue Sky Studios, and written by Derek Connolly, from a story by Jonathan Aibel, Glenn Berger and Matthew Robinson. The film stars Lucas Till, Jane Levy, Amy Ryan, Rob Lowe, Danny Glover, Barry Pepper and Holt McCallany, and follows a high schooler who finds an escaped monster living in his truck.",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/1/1f/Monster_Trucks_poster.jpg",
            "thumbnail_width": 253,
            "thumbnail_height": 394
          },
          {
            "title": "XXX: Return of Xander Cage",
            "year": 2017,
            "cast": [
              "Vin Diesel",
              "Samuel L. Jackson",
              "Donnie Yen",
              "Deepika Padukone",
              "Kris Wu",
              "Nina Dobrev",
              "Tony Jaa",
              "Ruby Rose",
              "Toni Collette"
            ],
            "genres": [
              "Action",
              "Thriller"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/XXX%20-%20Return%20of%20Xander%20Cage_VJ%20ICEP-Mobifliks.com.mp4",
            "extract": "XXX: Return of Xander Cage is a 2017 American action thriller film directed by D.J. Caruso and written by F. Scott Frazier. The film stars Vin Diesel in the lead role, Donnie Yen, Deepika Padukone, Kris Wu, Ruby Rose, Tony Jaa, Nina Dobrev, Toni Collette, Ariadna Gutiérrez, Hermione Corfield, and Samuel L. Jackson. It is the third installment in the XXX film series and a sequel to both XXX (2002) and XXX: State of the Union (2005).",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/9/9c/Xxx_return_of_xander_cage_film_poster.jpeg",
            "thumbnail_width": 259,
            "thumbnail_height": 404
          },
          {
            "title": "Batman: The Doom That Came to Gotham",
            "year": 2017,
            "cast": [
              "Will Arnett",
              "Zach Galifianakis",
              "Michael Cera",
              "Rosario Dawson",
              "Ralph Fiennes"
            ],
            "genres": [
              "Animated",
              "Comedy",
              "Superhero"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Batman-%20The%20Doom%20That%20Came%20to%20Gotham%20by%20Vj%20Kevo%20-%20Mobifliks.com.mp4",
            "extract": "An ancient evil awakens and only Bruce Wayne can save 1920s Gotham City.",
            "thumbnail": "https://www.mobifliks.com/scripts/timthumb2.php?src=https://www.mobifliks.com/admin/thumbs/Batman_%20The%20Doom%20That%20Came%20to%20Gotham%20(2023).jpg&h=220&w=140&a=t&zc=1",
            "thumbnail_width": 220,
            "thumbnail_height": 326
          },
          {
            "title": "John Wick: Chapter 2",
            "year": 2017,
            "cast": [
              "Keanu Reeves",
              "Common",
              "Bridget Moynahan",
              "Ian McShane",
              "John Leguizamo",
              "Ruby Rose",
              "Laurence Fishburne"
            ],
            "genres": [
              "Action",
              "Thriller"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/John%20Wick%202_Luganda_264_www.mobifliks.com.mp4",
            "extract": "John Wick: Chapter 2 is a 2017 American action thriller film directed by Chad Stahelski and written by Derek Kolstad. The film is sequel to John Wick (2014) and the second installment in the John Wick franchise. It stars Keanu Reeves as the eponymous character, alongside Common, Laurence Fishburne, Riccardo Scamarcio, Ruby Rose, Lance Reddick, Peter Stormare, Bridget Moynahan, Franco Nero, John Leguizamo, and Ian McShane. In the film, retired hitman John Wick is forced back into his old life to fulfill a blood oath to crime lord Santino D'Antonio (Scamarcio).",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/3/31/John_Wick_Chapter_Two.png",
            "thumbnail_width": 220,
            "thumbnail_height": 339
          },
          {
            "title": "The Great Wall",
            "year": 2017,
            "cast": [
              "Matt Damon",
              "Jing Tian",
              "Pedro Pascal",
              "Willem Dafoe",
              "Lu Han",
              "Andy Lau"
            ],
            "genres": [],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/The%20Great%20Wall%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
            "extract": "The Great Wall is a 2016 monster film directed by Zhang Yimou, with a screenplay by Carlo Bernard, Doug Miro and Tony Gilroy, from a story by Max Brooks, Edward Zwick and Marshall Herskovitz. An American and Chinese co-production starring Matt Damon, Jing Tian, Pedro Pascal, Willem Dafoe, and Andy Lau, the plot centers around two European mercenary warriors imprisoned by imperial Chinese forces within the Great Wall of China after arriving in search of gunpowder, eventually joining forces with the Chinese to help combat an alien threat. The Great Wall is Zhang's first English-language film.",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/c/cd/The_Great_Wall_%28film%29.png",
            "thumbnail_width": 220,
            "thumbnail_height": 329
          },
          {
            "title": "Fist Fight",
            "year": 2017,
            "cast": [
              "Ice Cube",
              "Charlie Day",
              "Christina Hendricks",
              "Dennis Haysbert",
              "Tracy Morgan",
              "Jillian Bell",
              "Dean Norris"
            ],
            "genres": [
              "Comedy"
            ],
            "href": "https://mobifliks.info/downloadmp4.php?file=luganda/Fist%20Fight%20by%20Vj%20Junior%20-%20Mobifliks.com.mp4",
            "extract": "Fist Fight is a 2017 American comedy film directed by Richie Keen and written by Van Robichaux and Evan Susser. The film stars Ice Cube, Charlie Day, Tracy Morgan and Jillian Bell with Dean Norris, Christina Hendricks, Kumail Nanjiani and Dennis Haysbert in supporting roles.",
            "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b2/Fist_Fight.png",
            "thumbnail_width": 220,
            "thumbnail_height": 326
          }
]